<template>
  <v-container>
    <v-layout wrap>
      <v-flex xs12 text-xs-center my-5>
        <h2 class="headline font-weight-thin"> {{ main.title }} </h2>
      </v-flex>
      <v-flex xs12 my-5>
        <v-card class="pa-4">
          <h2 class="mt-2 mb-5 font-weight-regular"> {{ main.subTitle }} </h2>
          <p class="my-4 subheading font-weight-thin" v-for="(text, i) in main.texts" :key="i" v-html="text">  </p>
        </v-card>
      </v-flex>
    </v-layout>
  </v-container>
</template>
<script>
export default {
  head() {
    return {
      title: 'Αρχεία - Πληροφορίες | Φορέας Διαχείρισης Λίμνης Κερκίνης',
      meta: [
        {
          hid: 'description', name: 'description',
          content: 'Γενικές πληροφορίες και τρόποι χρήσης για τη διαχείρηση δεδομένων των Αρχείων για τον Φορέα Διαχείρισης Λίμνης Κερκίνης.'
        }
      ]
    }
  },
  data() {
    return {
      main: {
        title: 'Εγχειρίδιο χρήσης αρχείων',
        subTitle: 'Γενικές πληροφορίες',
        texts: [
          '<span class="ml-3"></span>Στο menu παντώντας στο drop-list <b>Αρχεία</b> σας ανοίγονται όλες οι υπάρχουσες επιλογές πλοήγησης. Από εκεί μπορείτε να επιλέξετε μεταξύ <b>Αναζήτησης</b>, πλοήγηση προς τα <b>Σχετίκα</b> (πληροφορίες).',
          '<span class="ml-3"></span>Αρχεία μπορούν να εισαχθούν σε συγκεκριμένα δείγματα ( π.χ. Δειγμα Θηλαστικών ) μέσω της σελίδας επεξεργασίας ενός ήδη αποθηκευμένου δείγματος θηλαστικών. Εκεί θα δίνεται η δυνατότητα στον χρήστη να είσαγει αρχείο για το συγκεκριμένο δείγμα.',
          '<span class="ml-3"></span>Πηγαίνοντας στη σελίδα <b>Αναζήτηση</b> θα μεταφερθείτε σε μία σελίδα που αυτόματα θα σας εμφανίσει τα 10 τελευταία εγγεγραμμένα αρχεία. Από εκεί θα σας δίνεται η δυνατότητα να μεταφερθείτε στα συγκεκριμένα αρχεία που ζητάτε για παραπάνω ενέργειες. Για την αναζήτηση περισσοτέρων αρχείων μπορείτε να πλοηγηθείτε στις επόμενες σελίδες μέσω του Pagination στο κάτω μέρος της σελίδας.',
          '<span class="ml-3"></span>Πλοηγώντας σε συγκεκριμένο αρχείο μέσω της αναζήτησης θα έχετε την δυνατότητα <span class="light-blue--text">Διαγραφής</span> (Προσοχή η διαγραφή δεν αναιρείται και συνδεόμενα δεδομένα μπορεί να χαθούν) του αρχείου. Διαγραφή αρχείων μπορεί να γίνει επίσης μέσω της σελίδας εγγεγραμένων αρχείων σε κάθε συγκεκριμένο δείγμα ( π.χ. Δείγμα Θηλαστικών ).',
          '<span class="ml-3"></span>Καθ όλη την χρήση των εκάστοτε σελίδων υπάρχει ενημέρωση προς τον χρήστη για περιπτώσεις σφαλμάτων, επιτυχών ενεργειών του χρήστη καθώς και βοηθητικά μυνήματα για την συμπλήρωση νέων εγγραφών.'
        ]
      }
    }
  }
}
</script>