<template>
  <v-container>
    <v-layout wrap>
      <v-flex xs12 text-xs-center my-5>
        <h2 class="headline font-weight-thin"> {{ main.title }} </h2>
      </v-flex>
      <v-flex xs12 my-5>
        <v-card class="pa-4">
          <h2 class="mt-2 mb-5 font-weight-regular"> {{ main.subTitle }} </h2>
          <p class="my-4 subheading font-weight-thin" v-for="(text, i) in main.texts" :key="i" v-html="text">  </p>
          <div class="my-5">
            <h2 class="mb-4 font-weight-regular" v-html="main.pictureTitle"></h2>
            <prwtokola-excel/>
          </div>
        </v-card>
      </v-flex>
    </v-layout>
  </v-container>
</template>
<script>
import PrwtokolaExcel from "~/components/PrwtokolaExcel.vue";
export default {
  components: {
    PrwtokolaExcel
  },
  head() {
    return {
      title: 'Πρωτόκολλα - Πληροφορίες | Φορέας Διαχείρισης Λίμνης Κερκίνης',
      meta: [
        {
          hid: 'description', name: 'description',
          content: 'Γενικές πληροφορίες και τρόποι χρήσης για τη διαχείρηση δεδομένων των Πρωτοκόλλων για τον Φορέα Διαχείρισης Λίμνης Κερκίνης.'
        }
      ]
    }
  },
  data() {
    return {
      main: {
        title: 'Εγχειρίδιο χρήσης πρωτοκόλλων',
        subTitle: 'Γενικές πληροφορίες',
        texts: [
          '<span class="ml-3"></span>Στο menu παντώντας στο drop-list <b>Πρωτόκολλα</b> σας ανοίγονται όλες οι υπάρχουσες επιλογές πλοήγησης. Από εκεί μπορείτε να επιλέξετε μεταξύ <b>Αναζήτησης</b>, πλοήγηση προς τα <b>Σχετίκα</b> (πληροφορίες) ή δημιουργία <b>Νέας Εγγραφής</b>.',
          '<span class="ml-3"></span>Πηγαίνοντας στην δημιουργία νέας εγγραφής θα πλοηγηθείτε σε μία σελίδα με δύο δυνατότητες, με την χρήση μίας φόρμας οπού θα συμπληρώσετε τα απαραίτητα δεδομένα για την νέα εγγραφή και με την αποστολή αρχείου excel ( <b class="green--text">xlsx</b> ) σχεδειασμένου με σώστα πεδία για πολλαπλές νέες εγγραφές. Η φόρμα θα σας δώσει την δυνατότητα αποστολής μόνο εφόσον τηρούνται οι απαραίτητοι κανόνες. Τέτοιοι είναι η συμπλήρωση αναγκαστικών πεδίων και η μείωση χαρακτήρων ανά πεδίο στα όρια που απαιτεί το κάθε ένα. Προσοχή: Για την χρήση αρχείου excel ( <b class="green--text">xlsx</b> ) να τηρηθούν οι απαραίτητοι κανόνες.',
          '<span class="ml-3"></span>Πηγαίνοντας στη σελίδα <b>Αναζήτηση</b> θα μεταφερθείτε σε μία σελίδα που αυτόματα θα σας εμφανίσει τα 10 τελευταία εγγεγραμμένα πρωτόκολλα. Από εκεί θα σας δίνεται η δυνατότητα να μεταφερθείτε στα συγκεκριμένα πρωτόκολλα που ζητάτε για παραπάνω ενέργειες. Για την αναζήτηση περισσοτέρων πρωτοκόλλων μπορείτε να πλοηγηθείτε στις επόμενες σελίδες μέσω του Pagination στο κάτω μέρος της σελίδας.',
          '<span class="ml-3"></span>Πλοηγώντας σε συγκεκριμένο πρωτόκολλο μέσω της αναζήτησης θα έχετε τις δυνατότητες <span class="light-blue--text">Επεξεργασίας</span> και αποθήκευσης των αλλαγών, <span class="light-blue--text">Διαγραφής</span> (Προσοχή η διαγραφή δεν αναιρείται και συνδεόμενα δεδομένα μπορεί να χαθούν) του πρωτοκόλλου καθώς.',
          '<span class="ml-3"></span>Καθ όλη την χρήση των εκάστοτε σελίδων υπάρχει ενημέρωση προς τον χρήστη για περιπτώσεις σφαλμάτων, επιτυχών ενεργειών του χρήστη καθώς και βοηθητικά μυνήματα για την συμπλήρωση νέων εγγραφών.'
        ],
        pictureTitle: 'Παράδειγμα ενός excel ( <span class="green--text">xlsx</span> ) Πρωτοκόλου'
      }
    }
  }
}
</script>
